{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "eft",
    "1": "oystercatcher, oyster catcher",
    "2": "green lizard, Lacerta viridis",
    "3": "junco, snowbird",
    "4": "Chihuahua",
    "5": "Sealyham terrier, Sealyham",
    "6": "basset, basset hound",
    "7": "pelican",
    "8": "soft-coated wheaten terrier",
    "9": "bulbul",
    "10": "loggerhead, loggerhead turtle, Caretta caretta",
    "11": "thunder snake, worm snake, Carphophis amoenus",
    "12": "American chameleon, anole, Anolis carolinensis",
    "13": "African crocodile, Nile crocodile, Crocodylus niloticus",
    "14": "toy terrier",
    "15": "triceratops",
    "16": "bald eagle, American eagle, Haliaeetus leucocephalus",
    "17": "Dandie Dinmont, Dandie Dinmont terrier",
    "18": "European gallinule, Porphyrio porphyrio",
    "19": "cock",
    "20": "alligator lizard",
    "21": "Blenheim spaniel",
    "22": "jay",
    "23": "silky terrier, Sydney silky",
    "24": "redshank, Tringa totanus",
    "25": "red-backed sandpiper, dunlin, Erolia alpina",
    "26": "ruddy turnstone, Arenaria interpres",
    "27": "giant schnauzer",
    "28": "Pekinese, Pekingese, Peke",
    "29": "Lhasa, Lhasa apso",
    "30": "brambling, Fringilla montifringilla",
    "31": "robin, American robin, Turdus migratorius",
    "32": "beagle",
    "33": "vulture",
    "34": "miniature schnauzer",
    "35": "American coot, marsh hen, mud hen, water hen, Fulica americana",
    "36": "whiptail, whiptail lizard",
    "37": "Airedale, Airedale terrier",
    "38": "frilled lizard, Chlamydosaurus kingi",
    "39": "ostrich, Struthio camelus",
    "40": "Afghan hound, Afghan",
    "41": "Shih-Tzu",
    "42": "European fire salamander, Salamandra salamandra",
    "43": "Scotch terrier, Scottish terrier, Scottie",
    "44": "papillon",
    "45": "axolotl, mud puppy, Ambystoma mexicanum",
    "46": "leatherback turtle, leatherback, leathery turtle, Dermochelys coriacea",
    "47": "West Highland white terrier",
    "48": "house finch, linnet, Carpodacus mexicanus",
    "49": "hen",
    "50": "cairn, cairn terrier",
    "51": "American alligator, Alligator mississipiensis",
    "52": "Rhodesian ridgeback",
    "53": "chickadee",
    "54": "albatross, mollymawk",
    "55": "bullfrog, Rana catesbeiana",
    "56": "tree frog, tree-frog",
    "57": "ringneck snake, ring-necked snake, ring snake",
    "58": "Tibetan terrier, chrysanthemum dog",
    "59": "water ouzel, dipper",
    "60": "bloodhound, sleuthhound",
    "61": "Boston bull, Boston terrier",
    "62": "black grouse",
    "63": "terrapin",
    "64": "common newt, Triturus vulgaris",
    "65": "great grey owl, great gray owl, Strix nebulosa",
    "66": "mud turtle",
    "67": "standard schnauzer",
    "68": "ptarmigan",
    "69": "Lakeland terrier",
    "70": "goldfinch, Carduelis carduelis",
    "71": "Australian terrier",
    "72": "magpie",
    "73": "bustard",
    "74": "common iguana, iguana, Iguana iguana",
    "75": "Gila monster, Heloderma suspectum",
    "76": "Komodo dragon, Komodo lizard, dragon lizard, giant lizard, Varanus komodoensis",
    "77": "indigo bunting, indigo finch, indigo bird, Passerina cyanea",
    "78": "dowitcher",
    "79": "green snake, grass snake",
    "80": "agama",
    "81": "hognose snake, puff adder, sand viper",
    "82": "African chameleon, Chamaeleo chamaeleon",
    "83": "banded gecko",
    "84": "Maltese dog, Maltese terrier, Maltese",
    "85": "Japanese spaniel",
    "86": "king penguin, Aptenodytes patagonica",
    "87": "tailed frog, bell toad, ribbed toad, tailed toad, Ascaphus trui",
    "88": "spotted salamander, Ambystoma maculatum"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Afghan hound, Afghan": 40,
    "African chameleon, Chamaeleo chamaeleon": 82,
    "African crocodile, Nile crocodile, Crocodylus niloticus": 13,
    "Airedale, Airedale terrier": 37,
    "American alligator, Alligator mississipiensis": 51,
    "American chameleon, anole, Anolis carolinensis": 12,
    "American coot, marsh hen, mud hen, water hen, Fulica americana": 35,
    "Australian terrier": 71,
    "Blenheim spaniel": 21,
    "Boston bull, Boston terrier": 61,
    "Chihuahua": 4,
    "Dandie Dinmont, Dandie Dinmont terrier": 17,
    "European fire salamander, Salamandra salamandra": 42,
    "European gallinule, Porphyrio porphyrio": 18,
    "Gila monster, Heloderma suspectum": 75,
    "Japanese spaniel": 85,
    "Komodo dragon, Komodo lizard, dragon lizard, giant lizard, Varanus komodoensis": 76,
    "Lakeland terrier": 69,
    "Lhasa, Lhasa apso": 29,
    "Maltese dog, Maltese terrier, Maltese": 84,
    "Pekinese, Pekingese, Peke": 28,
    "Rhodesian ridgeback": 52,
    "Scotch terrier, Scottish terrier, Scottie": 43,
    "Sealyham terrier, Sealyham": 5,
    "Shih-Tzu": 41,
    "Tibetan terrier, chrysanthemum dog": 58,
    "West Highland white terrier": 47,
    "agama": 80,
    "albatross, mollymawk": 54,
    "alligator lizard": 20,
    "axolotl, mud puppy, Ambystoma mexicanum": 45,
    "bald eagle, American eagle, Haliaeetus leucocephalus": 16,
    "banded gecko": 83,
    "basset, basset hound": 6,
    "beagle": 32,
    "black grouse": 62,
    "bloodhound, sleuthhound": 60,
    "brambling, Fringilla montifringilla": 30,
    "bulbul": 9,
    "bullfrog, Rana catesbeiana": 55,
    "bustard": 73,
    "cairn, cairn terrier": 50,
    "chickadee": 53,
    "cock": 19,
    "common iguana, iguana, Iguana iguana": 74,
    "common newt, Triturus vulgaris": 64,
    "dowitcher": 78,
    "eft": 0,
    "frilled lizard, Chlamydosaurus kingi": 38,
    "giant schnauzer": 27,
    "goldfinch, Carduelis carduelis": 70,
    "great grey owl, great gray owl, Strix nebulosa": 65,
    "green lizard, Lacerta viridis": 2,
    "green snake, grass snake": 79,
    "hen": 49,
    "hognose snake, puff adder, sand viper": 81,
    "house finch, linnet, Carpodacus mexicanus": 48,
    "indigo bunting, indigo finch, indigo bird, Passerina cyanea": 77,
    "jay": 22,
    "junco, snowbird": 3,
    "king penguin, Aptenodytes patagonica": 86,
    "leatherback turtle, leatherback, leathery turtle, Dermochelys coriacea": 46,
    "loggerhead, loggerhead turtle, Caretta caretta": 10,
    "magpie": 72,
    "miniature schnauzer": 34,
    "mud turtle": 66,
    "ostrich, Struthio camelus": 39,
    "oystercatcher, oyster catcher": 1,
    "papillon": 44,
    "pelican": 7,
    "ptarmigan": 68,
    "red-backed sandpiper, dunlin, Erolia alpina": 25,
    "redshank, Tringa totanus": 24,
    "ringneck snake, ring-necked snake, ring snake": 57,
    "robin, American robin, Turdus migratorius": 31,
    "ruddy turnstone, Arenaria interpres": 26,
    "silky terrier, Sydney silky": 23,
    "soft-coated wheaten terrier": 8,
    "spotted salamander, Ambystoma maculatum": 88,
    "standard schnauzer": 67,
    "tailed frog, bell toad, ribbed toad, tailed toad, Ascaphus trui": 87,
    "terrapin": 63,
    "thunder snake, worm snake, Carphophis amoenus": 11,
    "toy terrier": 14,
    "tree frog, tree-frog": 56,
    "triceratops": 15,
    "vulture": 33,
    "water ouzel, dipper": 59,
    "whiptail, whiptail lizard": 36
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.25.1"
}
